docs: remove mermaid
